// Напишите программу, которая принимает на вход три числа и 
// выдаёт максимальное из этих чисел.

Console.Clear();

Console.WriteLine("Введите число A");
int num_A = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите число B");
int num_B = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите число C");
int num_C = Convert.ToInt32(Console.ReadLine());

if (num_A > max) max = num_A;
if (num_B > max) max = num_B;
if (num_C > max) max = num_C;


Console.Write("max =");



